# Lesson 4.5

In [1]:
# Import librairies
import pandas as pd
import numpy as np
import os

In [3]:
path = r'C:\Users\salmi\Desktop\Projects\Achievement 4\Instacart Basket Analysis'

In [5]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [7]:
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [102]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_amount,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [103]:
# Create a dataframe
df_test = pd.DataFrame()

In [104]:
# Create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [105]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [106]:
#code to check dataframe mixed type columns.

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\salmi\AppData\Local\Temp\ipykernel_456\1479647585.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [107]:
df_test['mix'] = df_test['mix'].astype('str') # changed the data type of the column

#### Finding missing values

In [108]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [109]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [110]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [111]:
df_prods.shape

(49693, 5)

In [112]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False] # get the df_prods without the missing values

In [113]:
df_prods_clean.shape

(49677, 5)

#### Finding duplicates

In [114]:
df_dups = df_prods_clean[df_prods_clean.duplicated()] ## finding the duplicates

In [115]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [116]:
df_prods_clean.shape

(49677, 5)

In [117]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates() ### removing duplicates from df_prods

In [118]:
df_prods_clean_no_dups.shape

(49672, 5)

In [119]:
df_ords.columns ###checking columns to delete

Index(['Unnamed: 0', 'order_id', 'user_id', 'order_amount',
       'orders_day_of_week', 'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

In [120]:
## Dropping the "Unnamed: 0' column
df_ords = df_ords.drop(columns=['Unnamed: 0'])

In [121]:
df_ords.columns

Index(['order_id', 'user_id', 'order_amount', 'orders_day_of_week',
       'order_hour_of_day', 'days_since_prior_order'],
      dtype='object')

# Task 4.5

In [122]:
df_ords.describe()

,order_id,user_id,order_amount,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [125]:
## Checking for mixed data in df_ords
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [126]:
## Checking for mixed data in df_prods
for col in df_prods.columns.tolist():
  weird = (df_prods[[col]].map(type) != df_prods[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_prods[weird]) > 0:
    print (col)

product_name

In [127]:
## Product name having mixed data is understandable as some products might have numbers in their names

In [129]:
## Checking for missing value in df_ords
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_amount                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [133]:
## here it seems that there is more than 206209 missing value. However since it is in the column days_since_prior_order, it could be that it
# is because there was no day before that so nothing was recorded, for example if it is a new customer and its his/her first time buy

In [134]:
df_nan_ords = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [135]:
df_nan_ords

,order_id,user_id,order_amount,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

##### Since the amount of rows with null data is consequent the data will not be deleted or imputed. As mentioned these are new customers that did not have anny prior oders before.

In [137]:
## Checking for duplicates in df_ords
df_dups_ords = df_ords[df_ords.duplicated()]

In [138]:
df_dups_ords

Empty DataFrame
Columns: [order_id, user_id, order_amount, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

##### The dataframe df_ords has no duplicate

### Exporting df_ords dataframe as orders_clean.csv and df_prods_clean_no_dups as products_clean.csv

In [139]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_clean.csv')) ## exporting df_ords

In [140]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_clean.csv')) ## exporting df_prods_clean_no_dups